## Pandas

In [66]:
import numpy as np

In [67]:
import pandas as pd

### Series

#### Initialisation

In [68]:
s_list = [1,2,3,4]
s_list2 = ['a','b','c','d']
arr = np.array(s_list2)
dict = {1:'a',2 :'c',3 : 'd', 4 : 'b'}

In [69]:
pd.Series(data = s_list) # intitialisation by name # default index is list of integers.

0    1
1    2
2    3
3    4
dtype: int64

In [70]:
pd.Series(data = s_list, index = arr) # intitialisation by name

a    1
b    2
c    3
d    4
dtype: int64

In [71]:
pd.Series([1,2,3],[1,'a','c']) # intialisation by data

1    1
a    2
c    3
dtype: int64

In [72]:
pd.Series(dict) # initialisation using a dictionary

1    a
2    c
3    d
4    b
dtype: object

#### Working with series

In [73]:
list2 = [1,2,3,4]
a = pd.Series(list2)

In [74]:
np.sqrt(a) # most of the other commands will work this way.

0    1.000000
1    1.414214
2    1.732051
3    2.000000
dtype: float64

In [75]:
a[1] # values can be called with the corresponding keys

2

In [92]:
a[1] = 3 # new values can be assigned.
a[1]

0    1
1    3
2    3
3    4
5    6
dtype: int64

In [91]:
a[5] = 6  # new key value pair can be added this way.
a

0    1
1    3
2    3
3    4
5    6
dtype: int64

In [86]:
a[0:2] # Rows 0 - 2

0    1
1    3
dtype: int64

In [77]:
b = pd.Series([1,2,3,4],[7,8,9,9]) # same index can be given 2 values
b

7    1
8    2
9    3
9    4
dtype: int64

In [78]:
b[9] # Unlike dictionaries, all the values for a corresponnding key will get listed.

9    3
9    4
dtype: int64

In [87]:
sports1 = pd.Series(['1','2','3','4'],['football','basketball','volleyball','cricket'])

In [88]:
sports2 = pd.Series(['22','24','42','3'],['football','baseball','volleyball','cricket'])

In [89]:
sports1 + sports2 # Series can be added. Sum of only those values will appear which had keys in both the series.

baseball      NaN
basketball    NaN
cricket        43
football      122
volleyball    342
dtype: object

Note that when strings are added, they get concatenated.

### DataFrames

#### Initialisation

In [97]:
df = pd.DataFrame(data = np.random.randint(20,30,(3,4)), index = "1 2 3".split(), columns = "A B C D".split()) # calling using split.
df

    A   B   C   D
1  21  21  24  28
2  23  24  27  20
3  21  28  21  29

It can be done traditionally, using some arrays as well.

In [110]:
df2 = pd.DataFrame({'A':[1,2,3],'B':[2,3,4]}) # calling using dictionary
df2

   A  B
0  1  2
1  2  3
2  3  4

#### Working with dataframes

In [104]:
np.sqrt(df) # most other functions work this way.

          A         B         C         D         E
1  4.582576  4.582576  4.898979  5.291503  6.480741
2  4.795832  4.898979  5.196152  4.472136  6.855655
3  4.582576  5.291503  4.582576  5.385165  7.000000

In [99]:
df['A'] # Calling by column name

1    21
2    23
3    21
Name: A, dtype: int32

In [103]:
df['E'] = df['A'] + df['B'] # assigning new columns
df

    A   B   C   D   E
1  21  21  24  28  42
2  23  24  27  20  47
3  21  28  21  29  49

In [108]:
df['F'] = [1,2,3] # assigning new columns.
df

    A   B   C   D   E  F
1  21  21  24  28  42  1
2  23  24  27  20  47  2
3  21  28  21  29  49  3

#### Uploading DataFrames

In [112]:
import os   # To know the current working directory
os.getcwd()

'C:\\Users\\DELL'

In [114]:
df3 = pd.read_excel("new.xlsx")
df3.head() # To get the first 5 rows

   Unnamed: 0 Unnamed: 1 Unnamed: 2 Unnamed: 3 Unnamed: 4 Unnamed: 5
0         NaN        NaN        NaN        NaN        NaN        NaN
1         NaN        hi       hello        are       you       there
2         NaN        NaN        NaN        NaN        NaN        NaN
3         NaN          1          2          3          5          4
4         NaN          4         54          5          4         34

In [118]:
df3 = pd.read_csv("https://raw.githubusercontent.com/Premalatha-success/Statistics/main/CardioGoodFitness-1.csv")
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product        180 non-null    object
 1   Age            180 non-null    int64
 2   Gender         180 non-null    object
 3   Education      180 non-null    int64
 4   MaritalStatus  180 non-null    object
 5   Usage          180 non-null    int64
 6   Fitness        180 non-null    int64
 7   Income         180 non-null    int64
 8   Miles          180 non-null    int64
dtypes: int64(6), object(3)
memory usage: 12.8+ KB